# Assignment 3(b)

Q.No. 3(b): Create a dataframe using np.random.randn function with 5 rows and 4 columns, and perform various operations using pandas library.

Solution :

In [1]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame(np.random.randn(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [6]:
df.head()

       Column1   Column2   Column3   Column4
Row1  0.658118  0.522028  1.517849 -0.468950
Row2  0.562665 -0.344317  0.035377 -1.495281
Row3  1.986701 -0.870431 -0.131957  0.797058
Row4  0.000455 -0.660075  0.945842 -0.475729
Row5  0.167997  0.458954 -0.286244 -1.104198

In [7]:
df.head(2)

       Column1   Column2   Column3   Column4
Row1  0.658118  0.522028  1.517849 -0.468950
Row2  0.562665 -0.344317  0.035377 -1.495281

In [8]:
df.tail()

       Column1   Column2   Column3   Column4
Row1  0.658118  0.522028  1.517849 -0.468950
Row2  0.562665 -0.344317  0.035377 -1.495281
Row3  1.986701 -0.870431 -0.131957  0.797058
Row4  0.000455 -0.660075  0.945842 -0.475729
Row5  0.167997  0.458954 -0.286244 -1.104198

In [9]:
df['Column1']

Row1    0.658118
Row2    0.562665
Row3    1.986701
Row4    0.000455
Row5    0.167997
Name: Column1, dtype: float64

In [10]:
df[['Column1','Column3']]

       Column1   Column3
Row1  0.658118  1.517849
Row2  0.562665  0.035377
Row3  1.986701 -0.131957
Row4  0.000455  0.945842
Row5  0.167997 -0.286244

In [11]:
df.loc['Row1']

Column1    0.658118
Column2    0.522028
Column3    1.517849
Column4   -0.468950
Name: Row1, dtype: float64

In [12]:
type(df.loc['Row1'])

pandas.core.series.Series

In [13]:
df.iloc[0:2,1:3]

       Column2   Column3
Row1  0.522028  1.517849
Row2 -0.344317  0.035377

In [17]:
df.iloc[3:,2:]

       Column3   Column4
Row4  0.945842 -0.475729
Row5 -0.286244 -1.104198

In [18]:
df.iloc[:,1:].values

array([[ 0.52202751,  1.51784948, -0.46894997],
       [-0.34431666,  0.03537707, -1.49528051],
       [-0.87043133, -0.13195707,  0.79705822],
       [-0.6600747 ,  0.94584178, -0.4757287 ],
       [ 0.4589537 , -0.28624397, -1.10419817]])

In [19]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [20]:
df.isnull()

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [23]:
df['Column1'].value_counts()

0.000455    1
0.658118    1
0.167997    1
1.986701    1
0.562665    1
Name: Column1, dtype: int64

In [24]:
df['Column1'].unique()

array([6.58118031e-01, 5.62664852e-01, 1.98670126e+00, 4.55006863e-04,
       1.67997317e-01])

In [25]:
df.shape

(5, 4)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      float64
 1   Column2  5 non-null      float64
 2   Column3  5 non-null      float64
 3   Column4  5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [27]:
df.describe()

        Column1   Column2   Column3   Column4
count  5.000000  5.000000  5.000000  5.000000
mean   0.675187 -0.178768  0.416173 -0.549420
std    0.781909  0.639387  0.779917  0.869963
min    0.000455 -0.870431 -0.286244 -1.495281
25%    0.167997 -0.660075 -0.131957 -1.104198
50%    0.562665 -0.344317  0.035377 -0.475729
75%    0.658118  0.458954  0.945842 -0.468950
max    1.986701  0.522028  1.517849  0.797058

In [28]:
df[df['Column1']>0.2]

       Column1   Column2   Column3   Column4
Row1  0.658118  0.522028  1.517849 -0.468950
Row2  0.562665 -0.344317  0.035377 -1.495281
Row3  1.986701 -0.870431 -0.131957  0.797058

In [29]:
df.corr()

          Column1   Column2   Column3   Column4
Column1  1.000000 -0.449628 -0.285313  0.772765
Column2 -0.449628  1.000000  0.256348 -0.497801
Column3 -0.285313  0.256348  1.000000  0.051402
Column4  0.772765 -0.497801  0.051402  1.000000

In [31]:
df

       Column1   Column2   Column3   Column4
Row1  0.658118  0.522028  1.517849 -0.468950
Row2  0.562665 -0.344317  0.035377 -1.495281
Row3  1.986701 -0.870431 -0.131957  0.797058
Row4  0.000455 -0.660075  0.945842 -0.475729
Row5  0.167997  0.458954 -0.286244 -1.104198